In [1]:
import pandas as pd

Read in the stock data from the file `data/closing-prices.csv`)

In [2]:
prices = pd.read_csv('./data/closing-prices.csv')

Look at the first few rows of the data to determine its structure

In [3]:
prices.head()

   Unnamed: 0        F    TSLA  GOOG       IBM     AAPL
0  2014-01-02  12.0890  150.10   NaN  157.6001  72.7741
1  2014-01-03  12.1438  149.56   NaN  158.5430  71.1756
2  2014-01-06  12.1986  147.00   NaN  157.9993  71.5637
3  2014-01-07  12.0420  149.36   NaN  161.1508  71.0516
4  2014-01-08  12.1673  151.28   NaN  159.6728  71.5019

In [4]:
prices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1007 entries, 0 to 1006
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1007 non-null   object
 1   F           1007 non-null   float64
 2   TSLA        1007 non-null   float64
 3   GOOG        949 non-null    float64
 4   IBM         1007 non-null   float64
 5   AAPL        1007 non-null   float64
dtypes: float64(5), object(1)
memory usage: 47.3+ KB

Re-read the prices file, with the following changes:

- Parse column 0 as a date
- Use column 0 as the index of the dataframe

In [5]:
prices = pd.read_csv('./data/closing-prices.csv', index_col=0, parse_dates=[0])

Look at the first few rows of the data to verify its structure

In [6]:
prices.head()

                  F    TSLA  GOOG       IBM     AAPL
2014-01-02  12.0890  150.10   NaN  157.6001  72.7741
2014-01-03  12.1438  149.56   NaN  158.5430  71.1756
2014-01-06  12.1986  147.00   NaN  157.9993  71.5637
2014-01-07  12.0420  149.36   NaN  161.1508  71.0516
2014-01-08  12.1673  151.28   NaN  159.6728  71.5019

Use the `.info()` method to see how much data and what type is in each column

In [7]:
prices.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1007 entries, 2014-01-02 to 2017-12-29
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   F       1007 non-null   float64
 1   TSLA    1007 non-null   float64
 2   GOOG    949 non-null    float64
 3   IBM     1007 non-null   float64
 4   AAPL    1007 non-null   float64
dtypes: float64(5)
memory usage: 47.2 KB

Using the following sqlite connection, save the data as a new table 'stocks'

In [8]:
import sqlite3
con = sqlite3.connect('./data/stocks.db')

In [9]:
prices.to_sql('stocks', con, if_exists='replace')

In [10]:
prices.head()

                  F    TSLA  GOOG       IBM     AAPL
2014-01-02  12.0890  150.10   NaN  157.6001  72.7741
2014-01-03  12.1438  149.56   NaN  158.5430  71.1756
2014-01-06  12.1986  147.00   NaN  157.9993  71.5637
2014-01-07  12.0420  149.36   NaN  161.1508  71.0516
2014-01-08  12.1673  151.28   NaN  159.6728  71.5019

In [11]:
pd.read_sql('select * from stocks', con).head()

                 index        F    TSLA  GOOG       IBM     AAPL
0  2014-01-02 00:00:00  12.0890  150.10   NaN  157.6001  72.7741
1  2014-01-03 00:00:00  12.1438  149.56   NaN  158.5430  71.1756
2  2014-01-06 00:00:00  12.1986  147.00   NaN  157.9993  71.5637
3  2014-01-07 00:00:00  12.0420  149.36   NaN  161.1508  71.0516
4  2014-01-08 00:00:00  12.1673  151.28   NaN  159.6728  71.5019

Use the following SQL statement to create a new dataframe:

```sql
SELECT [index], IBM, AAPL 
FROM stocks
WHERE IBM > 160
```

(make sure you set the 'index' column as your index, and parse it as a date)

In [34]:
query = '''
SELECT [index], IBM, AAPL 
FROM stocks
WHERE IBM > 160
'''
df = pd.read_sql(query, con, index_col='index', parse_dates=['index'])

In [35]:
df.head()

                 IBM     AAPL
index
2014-01-07  161.1508  71.0516
2014-01-16  160.3438  72.9215
2014-01-17  161.4736  71.1348
2014-01-21  160.0635  72.2400
2014-03-06  160.2662  70.2476

Examine the first few rows of the dataframe and use the `.info()` method to verify its structure

In [36]:
df.head()

                 IBM     AAPL
index
2014-01-07  161.1508  71.0516
2014-01-16  160.3438  72.9215
2014-01-17  161.4736  71.1348
2014-01-21  160.0635  72.2400
2014-03-06  160.2662  70.2476

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 177 entries, 2014-01-07 to 2017-04-17
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   IBM     177 non-null    float64
 1   AAPL    177 non-null    float64
dtypes: float64(2)
memory usage: 4.1 KB

In [38]:
df.index

DatetimeIndex(['2014-01-07', '2014-01-16', '2014-01-17', '2014-01-21',
               '2014-03-06', '2014-03-07', '2014-03-20', '2014-03-24',
               '2014-03-25', '2014-03-26',
               ...
               '2017-03-31', '2017-04-03', '2017-04-04', '2017-04-05',
               '2017-04-06', '2017-04-07', '2017-04-10', '2017-04-11',
               '2017-04-12', '2017-04-17'],
              dtype='datetime64[ns]', name='index', length=177, freq=None)

In [39]:
df.columns

Index(['IBM', 'AAPL'], dtype='object')

In [40]:
df.describe()

              IBM        AAPL
count  177.000000  177.000000
mean   164.523832  100.140523
std      2.745819   24.596355
min    160.063500   68.554800
25%    162.290500   79.146400
50%    164.278500   92.400800
75%    166.455700  129.109900
max    171.052800  141.471700